fe40/tutorials/rheoFoam/Cylinder/Oldroyd-BLog/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          uniform ( 1 0 0 );
    }

    outlet
    {
        type            zeroGradient;
    }

    "(walls|cylinder)"
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
     
    }
    
    frontAndBack
    {
        type           empty;
    }
    
}

// ************************************************************************* //
