fe40/tutorials/rheoFoam/Cylinder/Oldroyd-BLog/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
   "(p|U)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-10;
        relTol           0.001;
        minIter          0;
        maxIter          800;
        
    }

    "(theta|tau)"
    {

        solver           PBiCG;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-10;
        relTol            0.001;
        minIter           0;
        maxIter           1000;
    }
 
}

PostProcessing
{

 functions
 (
 
   CdMonitor
   {
     funcType           calcCd;
     enabled            true;
     evaluateInterval   50;     
   }
   
 );
 
}
 

SIMPLE
{
    nInIter         1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        
    }
}

relaxationFactors
{
     fields
      {        
        p 0.9;
      }

     equations
      { 
        U 1;
        tau 1;
        theta 1;
      }
}

// ************************************************************************* //
